import { FC } from "react";
import Typography from "@mui/material/Typography";
import { Box, Container, List, ListItem, ListItemText } from "@mui/material";

export const Engineering: FC = () => {
  return (
    <Container maxWidth="md">
      <Box sx={{ my: 4 }}>
        <Typography variant="h4" component="h1" gutterBottom textAlign="center">
          Інжинірингові послуги
        </Typography>
        <Typography variant="body1" paragraph>
          Наша компанія надає комплекс інжинірингових послуг, який включає:
        </Typography>
        <List>
          <ListItem>
            <ListItemText primary="• технічні дослідження і послуги, пов'язані з підготовкою виробничого процесу: проведення передпроектних робіт, наукових досліджень і розробок, складання технічних завдань і техніко-економічних обґрунтувань будівництва енергетичних, промислових і інших об'єктів, проведення інженерно-дослідницьких робіт для будівництва об'єктів, розробка технічної документації, проектування і конструкторське пророблення об'єктів техніки і технології, після проектні послуги при монтажі і пуско-налагоджувальних роботах, а також спеціальні послуги, пов'язані із особливостями створення кожного конкретного об'єкта (аналіз екологічних проблем та інше);" />
          </ListItem>
          <ListItem>
            <ListItemText primary="• загальне технічне сприяння, що забезпечує оптимальний процес виробництва на об'єкті, включаючи консультації й авторський нагляд за устаткуванням, консультації економічного і фінансового характеру, кон'юнктурні і маркетингові дослідження, консультації по впровадженню систем інформаційного забезпечення тощо." />
          </ListItem>
        </List>
      </Box>
    </Container>
  );
};
